__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 20, 120, 1)   0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 4, 24, 1)     0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 4, 32, 1)     0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 20, 120, 32)  160         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 4, 24, 32)    160         input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 4, 32, 32)    160         input_3[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 20, 120, 32)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 4, 24, 32)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 4, 32, 32)    0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 20, 120, 32)  0           activation_1[0][0]               
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 4, 24, 32)    0           activation_5[0][0]               
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 4, 32, 32)    0           activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 20, 120, 64)  8256        dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 4, 24, 64)    8256        dropout_5[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 4, 32, 64)    8256        dropout_9[0][0]                  
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 20, 120, 64)  0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 4, 24, 64)    0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 4, 32, 64)    0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 20, 120, 64)  0           activation_2[0][0]               
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 4, 24, 64)    0           activation_6[0][0]               
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 4, 32, 64)    0           activation_10[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 20, 120, 64)  16448       dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 4, 24, 64)    16448       dropout_6[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 4, 32, 64)    16448       dropout_10[0][0]                 
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 20, 120, 64)  0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 4, 24, 64)    0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 4, 32, 64)    0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 20, 120, 64)  0           activation_3[0][0]               
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 4, 24, 64)    0           activation_7[0][0]               
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 4, 32, 64)    0           activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 20, 120, 128) 32896       dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 4, 24, 128)   32896       dropout_7[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 4, 32, 128)   32896       dropout_11[0][0]                 
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 20, 120, 128) 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 4, 24, 128)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 4, 32, 128)   0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 20, 120, 128) 0           activation_4[0][0]               
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 4, 24, 128)   0           activation_8[0][0]               
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 4, 32, 128)   0           activation_12[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 128)          0           dropout_4[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 128)          0           dropout_8[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_3 (Glo (None, 128)          0           dropout_12[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          12900       global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          12900       global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 100)          12900       global_average_pooling2d_3[0][0] 
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 100)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 100)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 100)          0           dense_3[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 300)          0           activation_13[0][0]              
                                                                 activation_14[0][0]              
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 300)          0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 10)           3010        dropout_13[0][0]                 
==================================================================================================
Total params: 214,990
Trainable params: 214,990
Non-trainable params: 0
__________________________________________________________________________________________________
